Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_013/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 18.770ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 25.836ms, rate sampling interval: 95ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.35ms   23.24ms 456.96ms   94.99%
    Req/Sec   150.68     93.37   636.00     58.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.82ms
 75.000%   22.64ms
 90.000%   36.38ms
 99.000%   86.14ms
 99.900%  333.82ms
 99.990%  456.45ms
 99.999%  456.96ms
100.000%  457.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.215     0.000000            1         1.00
      14.327     0.100000         5114         1.11
      15.335     0.200000        10231         1.25
      16.151     0.300000        15324         1.43
      16.943     0.400000        20433         1.67
      17.823     0.500000        25533         2.00
      18.319     0.550000        28065         2.22
      18.943     0.600000        30580         2.50
      19.807     0.650000        33125         2.86
      21.039     0.700000        35687         3.33
      22.639     0.750000        38222         4.00
      23.887     0.775000        39489         4.44
      25.455     0.800000        40766         5.00
      27.423     0.825000        42040         5.71
      29.583     0.850000        43315         6.67
      32.639     0.875000        44586         8.00
      34.463     0.887500        45227         8.89
      36.383     0.900000        45864        10.00
      38.399     0.912500        46495        11.43
      40.735     0.925000        47139        13.33
      43.295     0.937500        47775        16.00
      44.831     0.943750        48092        17.78
      46.623     0.950000        48410        20.00
      48.671     0.956250        48728        22.86
      51.743     0.962500        49044        26.67
      55.327     0.968750        49361        32.00
      57.151     0.971875        49522        35.56
      59.519     0.975000        49680        40.00
      62.559     0.978125        49842        45.71
      65.983     0.981250        49998        53.33
      70.911     0.984375        50158        64.00
      74.175     0.985938        50237        71.11
      76.927     0.987500        50317        80.00
      82.495     0.989062        50400        91.43
      89.343     0.990625        50476       106.67
     105.215     0.992188        50555       128.00
     125.119     0.992969        50595       142.22
     150.527     0.993750        50635       160.00
     188.415     0.994531        50675       182.86
     200.191     0.995313        50716       213.33
     208.511     0.996094        50754       256.00
     226.175     0.996484        50775       284.44
     249.215     0.996875        50794       320.00
     260.735     0.997266        50814       365.71
     271.615     0.997656        50834       426.67
     304.127     0.998047        50854       512.00
     310.783     0.998242        50865       568.89
     319.487     0.998437        50874       640.00
     321.791     0.998633        50886       731.43
     330.751     0.998828        50897       853.33
     335.359     0.999023        50905      1024.00
     335.871     0.999121        50909      1137.78
     372.991     0.999219        50914      1280.00
     388.351     0.999316        50919      1462.86
     398.079     0.999414        50924      1706.67
     408.831     0.999512        50929      2048.00
     415.231     0.999561        50931      2275.56
     425.727     0.999609        50934      2560.00
     440.831     0.999658        50936      2925.71
     452.351     0.999707        50943      3413.33
     452.351     0.999756        50943      4096.00
     452.351     0.999780        50943      4551.11
     452.607     0.999805        50946      5120.00
     452.607     0.999829        50946      5851.43
     452.607     0.999854        50946      6826.67
     453.887     0.999878        50947      8192.00
     456.447     0.999890        50948      9102.22
     456.959     0.999902        50952     10240.00
     456.959     0.999915        50952     11702.86
     456.959     0.999927        50952     13653.33
     456.959     0.999939        50952     16384.00
     456.959     0.999945        50952     18204.44
     456.959     0.999951        50952     20480.00
     456.959     0.999957        50952     23405.71
     456.959     0.999963        50952     27306.67
     456.959     0.999969        50952     32768.00
     456.959     0.999973        50952     36408.89
     456.959     0.999976        50952     40960.00
     456.959     0.999979        50952     46811.43
     457.215     0.999982        50953     54613.33
     457.215     1.000000        50953          inf
#[Mean    =       23.349, StdDeviation   =       23.237]
#[Max     =      456.960, Total count    =        50953]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  53851 requests in 3.00m, 43.81MB read
Requests/sec:    299.12
Transfer/sec:    249.17KB